In [8]:
# import google.generativeai as genai
# from dotenv import load_dotenv
# import os

In [9]:
# load_dotenv()

False

- Step 1: impport

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

- Step:2 Create a Df using list

In [7]:
names=['Ramesh', 'SUresh', 'Sathish']
#pd.dataFrame(data, index, colums)
pd.DataFrame(names)

         0
0   Ramesh
1   SUresh
2  Sathish

In [8]:
names=['Ramesh', 'Suresh', 'Sathish']
ids=['A', 'B', 'C']
pd.DataFrame(names, ids)
# pd.DataFrame(data, index)

         0
A   Ramesh
B   Suresh
C  Sathish

In [10]:
names=['Ramesh', 'Suresh', 'Sathish']
cols=['names']
pd.DataFrame(names,cols)

ValueError: Shape of passed values is (3, 1), indices imply (1, 1)

In [11]:
names=['Ramesh', 'Suresh', 'Sathish']
#pd.DataFrame(data, index, columns)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

In [12]:
names=['Ramesh', 'Suresh', 'Sathish']
#index
ids=['A','B','C']
pd.DataFrame(names, ids)

         0
A   Ramesh
B   Suresh
C  Sathish

In [21]:
names=['Ramesh', 'Suresh', 'Sathish']

#index
index=['A', 'B', 'C']

#columns
cols=[ 'User Name']

pd.DataFrame(names, index, cols)

  User Name
A    Ramesh
B    Suresh
C   Sathish

# ***Multiple Columns***

In [25]:
names=['Ramesh', 'Suresh', 'Sathish']
age=[20,22,24]
pd.DataFrame(zip(names, age)) #combine the both columns

         0   1
0   Ramesh  20
1   Suresh  22
2  Sathish  24

names=['Ramesh', 'Suresh', 'Sathish']
age=[20,22,24]
cols=['Names', 'Age']
pd.DataFrame(zip(names, age), columns=cols) #combine the both columns

## Step-7: Add a new column to already existed df

In [43]:
names=['Ramesh', 'Suresh', 'Sathish']
age=[20,22,24]
cols=['Name', 'Age']
df=pd.DataFrame(zip(names,age), columns=cols)

city=['Hyd', 'Pune', 'Blr']

#Addition colums with row values assigned.
df['country']=city

#Addition colums with row values assigned.
marks=['80','90', '97']
df['Marks']=marks

df

      Name  Age country Marks
0   Ramesh   20     Hyd    80
1   Suresh   22    Pune    90
2  Sathish   24     Blr    97

### Step-9: Create empty dataframe and add the columns

In [44]:
df=pd.DataFrame()
df['Names']=['Ramesh', 'Suresh', 'Mahesh']
df['Age']=[20,22,15]
df['City']= ['HYd', 'Blr', 'PUne']

df

    Names  Age  City
0  Ramesh   20   HYd
1  Suresh   22   Blr
2  Mahesh   15  PUne

In [46]:
### step-10: Create a df using dictionary 

d={'Names': ['Ramesh', 'Suresh', 'Mahesh'],
    'Age': [20,22,24],
     'City': ['Hyd', 'Blr', 'Pune']
    }
df=pd.DataFrame(d)
df

    Names  Age  City
0  Ramesh   20   Hyd
1  Suresh   22   Blr
2  Mahesh   24  Pune

In [47]:
### step-10: Create a df using dictionary 

d={'Names': 'Ramesh',
    'Age': 20,
     'City': 'Hyd'
    }
df=pd.DataFrame(d)
df

ValueError: If using all scalar values, you must pass an index

In [57]:
### step-10: Create a df using dictionary 

d={'Names': 'Ramesh',
    'Age': 20,
     'City': 'Hyd'
    }
df=pd.DataFrame(d, index=[0])
df

    Names  Age City
0  Ramesh   20  Hyd

##Step-11:

## **Step-11:**

## **Step-11:**

### **Step-11:Save the dataFrame**

In [63]:
# file handling session
# direcory//filename.ext
# filename.ext
# we are saving dataframes
# .csv or .xmls

df.to_csv('/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/EDA/ata.csv')

In [64]:
df.to_excel('/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/EDA/excel.xlsx')

## step-12: Read the DataFrame

In [66]:
pd.read_csv('/Users/suniltomar/Desktop/workspace/nareshit_ds/DS_app1/EDA/ata.csv')

   Unnamed: 0   Names  Age City
0           0  Ramesh   20  Hyd

In [74]:
d={'Name':['Ramesh', 'Suresh', 'Satish'],
  'Age': [20,21,22],
  'City': ['Hyd', 'Blr', 'City']}
#creating data frame.
df=pd.DataFrame(d)
df['Marks']=[90,92,95]

In [75]:
df.to_csv('data1.csv', index=False)

In [76]:
pd.read_csv('data1.csv')

     Name  Age  City  Marks
0  Ramesh   20   Hyd     90
1  Suresh   21   Blr     92
2  Satish   22  City     95

## step-13: Drop the column

- labels
- axis
- index
- columns
- inplace

In [80]:
# Dropping the row. not drop column
df.drop(index=2)

     Name  Age City  Marks
0  Ramesh   20  Hyd     90
1  Suresh   21  Blr     92

In [82]:
# Dropping the column.
df.drop(columns='Marks')

     Name  Age  City
0  Ramesh   20   Hyd
1  Suresh   21   Blr
2  Satish   22  City

- in orde do this we need use implace
- by default inplace = False
-

## **Step-14: Rename the column**

In [86]:
d={'City': 'city'} # {old:new}
# df.rename(<mapper>, <axis>, <inplace>)
df.rename(d, axis=0, inplace=True)
df

     Name  Age  city  Marks
0  Ramesh   20   Hyd     90
1  Suresh   21   Blr     92
2  Satish   22  City     95

In [87]:
df.rename(d, axis=1, inplace=True)
df

     Name  Age  city  Marks
0  Ramesh   20   Hyd     90
1  Suresh   21   Blr     92
2  Satish   22  City     95

In [91]:
## Create one more df
# x=1 to 10
# y= square x
# z= cube x

d={'Name':['MalikArjun', 'Srinivas', 'Kartik', 'SitRam'],
   'Age': [21,22,23,16],
    'City': ['Hyd', 'Blr', 'Chennai', 'Agra']
    }
df=pd.DataFrame(d)
df

         Name  Age     City
0  MalikArjun   21      Hyd
1    Srinivas   22      Blr
2      Kartik   23  Chennai
3      SitRam   16     Agra

In [93]:
x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]

df=pd.DataFrame(zip(x,y,z), columns=['X', 'Y', 'Z'])
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

 - len
 - shape
 - size
 - head
 - tail
 - isnull
 - dtypes
 - info
 -

In [94]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [111]:
dir(df)

len(df)

10

In [105]:
df.head(2)

   X  Y  Z
0  1  1  1
1  2  4  8

In [108]:
df.tail(100)

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [109]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [115]:
# dtypes(df)
df.dtypes

X    int64
Y    int64
Z    int64
dtype: object

In [116]:
df.size

30

In [121]:
df.isnull().sum()

X    0
Y    0
Z    0
dtype: int64

In [122]:
df[['X', 'Y']].shape

(10, 2)

In [123]:
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [124]:
df['X']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [127]:
df['X'].values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [128]:
df['X'].value_counts

<bound method IndexOpsMixin.value_counts of 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64>

In [131]:
df # DataFrame
df['Z'] # selecting once particular column
df['Z'].values
df['Z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [135]:
df
df[['Y', 'Z']]

     Y     Z
0    1     1
1    4     8
2    9    27
3   16    64
4   25   125
5   36   216
6   49   343
7   64   512
8   81   729
9  100  1000